# StairsInstAlwaysUp Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsInstAlwaysUp Property
ParameterTypeId Class See Also
---
"Show Up arrow in all views"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsInstAlwaysUp { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsInstAlwaysUp As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsInstAlwaysUp {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace